src/cf/Catalogs/ТСПИоТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТСПИоТ</Name>
			<Comment>Технические средства передачи информации о товаре </Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭкземпляра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип ТО ПИоТ</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТСПИоТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФискальноеУстройство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКДрайверу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьДанныхЭкземпляра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньЛога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиСервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиПорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛМЧЗАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛМЧЗПорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛМЧЗПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛМЧЗПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьПроверкуКорневыхСертификатов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ТипыТСПИоТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыТСПИоТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Внешний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренний1С</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ТСПИоТ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СозданиеНовогоЭлемента = Объект.Ссылка = Справочники.ТСПИоТ.ПустаяСсылка(); 
	
	Если НЕ ЗначениеЗаполнено(Объект.ИдентификаторЭкземпляра) Тогда                                                
		Объект.ИдентификаторЭкземпляра = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;

	Если ОбщегоНазначенияБПО.ЭтоМобильнаяПлатформа() Тогда
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.Наименование);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ФискальноеУстройство);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.Тип);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПутьКДрайверу);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПутьДанныхЭкземпляра);      
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.УровеньЛога); 
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПроксиСервер);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПроксиПорт);   
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПроксиПользователь);                                           
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПроксиПароль);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ЛМЧЗАдрес);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ЛМЧЗПорт);   
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ЛМЧЗПользователь);                                           
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ЛМЧЗПароль);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ЗащищенноеСоединение);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.Сервер);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.Порт);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ОбменНаСервере);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.Таймаут);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПредставлениеПроксиСервера);
	КонецЕсли;
	
	ОбменНаСервере            = ?(Объект.ОбменНаСервере, 0, 1);
	
	ЦветВажногоТекста         = Новый Цвет(255, 0, 0);
	ЦветНеактивнойГиперссылки = Новый Цвет(200, 200, 200);
	
	ДоступностьИспользованияВнутреннегоТСПИоТ = ОбщегоНазначенияБПО.ИспользуетсяТСПИоТ() И ОбщегоНазначенияБПОКлиентСервер.Доступен1СПИоТ();                
	
	Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаНеВыполнялась;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриСозданииЧтенииНаСервере();
	КонецЕсли;
	
	Если Не СозданиеНовогоЭлемента Тогда
		Элементы.Тип.Доступность = НЕ (ЗначениеЗаполнено(Объект.ФискальноеУстройство) И Объект.Тип = Перечисления.ТипыТСПИоТ.Внутренний1С);
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПриОткрытии(Отказ)        
	
	РабочийКаталог = РабочийКаталогДанныхПользователя();      
	
	Если СозданиеНовогоЭлемента Тогда
		УстановитьПутиПоУмолчаниюСервер();
	КонецЕсли;
	
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Не ЕстьПодсистемаГОСиС Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ИмяСобытия = "Запись_НастройкиПодключенияЛокальныхМодулейИСМП" Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтображениеДанныхЛокальногоМодуляЧЗ();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииЧтенииНаСервере();
	ПриИзмененииФискальногоУстройстваНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СозданиеНовогоЭлемента = Ложь;
	
	УстановитьОтображениеДанныхЛокальногоМодуляЧЗ();
	УстановитьВидимостьДоступностьЭлементовВЗависимостиОтВидаПИоТ(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	ЕстьПодсистемаБСП   = ОбщегоНазначенияБПО.ИспользуетсяБСП();
	ЕстьПодсистемаГОСиС = ОбщегоНазначенияБПО.ИспользуетсяГосИС();
	
	УстановитьДоступностьИОбновитьСписокТиповПИоТ(ЭтотОбъект);
	ОбновитьДанныеПриУстановкеККТ();

	УстановитьОтображениеДанныхПрокси();   
	УстановитьОтображениеДанныхЛокальногоМодуляЧЗ();
	
	УстановитьВидимостьДоступностьЭлементовВЗависимостиОтВидаПИоТ(ЭтотОбъект);
	
КонецПроцедуры
   
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьЭлементовВЗависимостиОтВидаПИоТ(ЭтотОбъект);
	УстановитьНаименованиеЭкземпляраТСПИоТ();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗащищенноеСоединениеПриИзменении(Элемент)
	
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура СерверПодключенияПриИзменении(Элемент)
	
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПортПодключенияПриИзменении(Элемент)
	
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменНаСервереПриИзменении(Элемент)
	
	Если ОбменНаСервере = 1 Тогда
		Объект.ОбменНаСервере = Ложь;
	Иначе
		Объект.ОбменНаСервере = Истина;
	КонецЕсли;
	
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроверкаНеВыполненаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьНастройкаНеВыполненаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроверкаНеВыполняласьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФискальноеУстройсвоПриИзменении(Элемент)
	
	УстановитьДоступностьИОбновитьСписокТиповПИоТ(ЭтотОбъект);
	
	ПриИзмененииФискальногоУстройстваНаСервере();
	УстановитьНаименованиеЭкземпляраТСПИоТ();
	
	ОтобразитьНаФормеОтличияНастроекТСПИоТ();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресПодключенияЛМЧЗВнешнийПИоТНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЕстьПодсистемаГОСиС Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура("Организация, РабочееМесто, Приоритет", Организация, РабочееМесто, 0);
	Отбор               = Новый Структура("Организация, РабочееМесто, Приоритет", Организация, РабочееМесто, 0);
	
	ПослеЗакрытияФормыНастройкиПодключения = Новый ОписаниеОповещения("ПослеЗакрытияФормыНастройкиПодключенияЛокальногоМодуля", ЭтотОбъект);
	
	МодульОбменДанными = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОбменДаннымиКлиент");
	МодульОбменДанными.ОткрытьФормуЗаписиРегистраСведенийПоОтбору(Отбор,
		СтруктураЗаполнения,
		"НастройкиПодключенияЛокальныхМодулейИСМП",
		ЭтотОбъект,
		,,
		ПослеЗакрытияФормыНастройкиПодключения);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресПодключенияЛМЧЗВнутреннийПИоТНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЕстьПодсистемаГОСиС Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура("Организация, РабочееМесто, Приоритет", Организация, РабочееМесто, 0);
	Отбор               = Новый Структура("Организация, РабочееМесто, Приоритет", Организация, РабочееМесто, 0);
	
	ПослеЗакрытияФормыНастройкиПодключения = Новый ОписаниеОповещения("ПослеЗакрытияФормыНастройкиПодключенияЛокальногоМодуля", ЭтотОбъект);
	
	МодульОбменДанными = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОбменДаннымиКлиент");
	МодульОбменДанными.ОткрытьФормуЗаписиРегистраСведенийПоОтбору(Отбор,
		СтруктураЗаполнения,
		"НастройкиПодключенияЛокальныхМодулейИСМП",
		ЭтотОбъект,
		,,
		ПослеЗакрытияФормыНастройкиПодключения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПроксиСервераНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЕстьПодсистемаБСП Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
	ПоказатьПредупреждение(, НСтр("ru = 'В веб-клиенте параметры прокси-сервера необходимо задавать в настройках браузера.'"));
	Возврат;
	#КонецЕсли
	
	ИмяОткрываемойФормы = "ОбщаяФорма.ПараметрыПроксиСервера";
	ПослеЗакрытияОкнаНастройкаПроксиСервера = Новый ОписаниеОповещения("ПослеЗакрытияОкнаНастройкаПроксиСервера", ЭтотОбъект);
	
	ОткрытьФорму(ИмяОткрываемойФормы, Новый Структура("НастройкаПроксиНаКлиенте", Истина),,,,, ПослеЗакрытияОкнаНастройкаПроксиСервера);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьКорневыеСертификатыВнешнийПИоТПриИзменении(Элемент)
	
	Если Не ЕстьПодсистемаГОСиС Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПутьДрайверуПоУмолчанию(Команда)
	
	УстановитьПутьДрайверуПоУмолчаниюСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПутьЭкземпляраПоУмолчанию(Команда)
	
	УстановитьПутьЭкземпляраПоУмолчаниюСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаНастройкиПодключенияТСПИоТ

&НаКлиенте
Процедура ПроверитьНастройкиПодключения(ЗаполнитьНастройкиПринудительно = Ложь)
	
	Если Не Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыТСПИоТ.Внешний") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверитьКорректностьЗаполненияНастроек() Тогда
		ПодключитьОбработчикОжидания("ВыполнитьПроверкуПодключенияНачало", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКорректностьЗаполненияНастроек()
	
	Возврат ЗначениеЗаполнено(Объект.ФискальноеУстройство)
		И ЗначениеЗаполнено(Объект.Сервер)
		И ЗначениеЗаполнено(Объект.Порт);
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПроверкуПодключенияНачало() Экспорт
	
	Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаНеВыполнялась;
	
	ЗапуститьПроверкуПодключения();
	
КонецПроцедуры

#КонецОбласти

#Область ДлительныеПроцедуры

&НаКлиенте
Процедура ЗапуститьПроверкуПодключения()
	
	Если Не ЕстьПодсистемаГосИС Тогда
		Возврат;
	КонецЕсли;
		
	Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаВыполняется;
	ПослеВыполненияОбновления = Новый ОписаниеОповещения("ПослеВыполненияПроверкиНастройкиТСПИоТ", ЭтотОбъект);
	
	МодульОбщегоНазначенияИСМПКлиентСервер = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОбщегоНазначенияИСМПКлиентСервер");
	ПараметрыПодключения = МодульОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ();
	ПараметрыПодключения.Сервер               = Объект.Сервер;
	ПараметрыПодключения.ЗащищенноеСоединение = Объект.ЗащищенноеСоединение;
	ПараметрыПодключения.Порт                 = Объект.Порт;
	ПараметрыПодключения.ИсключитьПроверкуКорневыхСертификатов = Объект.ИсключитьПроверкуКорневыхСертификатов;
	
	ПараметрыОбработки = Новый Структура();
	ПараметрыОбработки.Вставить("ПараметрыПодключения",   ПараметрыПодключения);
	ПараметрыОбработки.Вставить("НеВыводитьОкноОжидания", Истина);
	
	МодульИнтерфейсИСМПОбщегоНазначенияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ИнтерфейсИСМПОбщегоНазначенияКлиент");
	ПараметрыЗапроса                         = МодульИнтерфейсИСМПОбщегоНазначенияКлиент.ПараметрыЗапросаДанных();
	ПараметрыЗапроса.ОповещениеОЗавершении   = ПослеВыполненияОбновления;
	ПараметрыЗапроса.УникальныйИдентификатор = УникальныйИдентификатор;
	ПараметрыЗапроса.Параметры               = ПараметрыОбработки;
	ПараметрыЗапроса.ВыполнениеНаКлиенте     = Не Объект.ОбменНаСервере;
	
	МодульИнтерфейсИСМПОбщегоНазначенияКлиент.ПолучитьДанныеНастройкиТСПИоТ(ПараметрыЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияПроверкиНастройкиТСПИоТ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ЕстьОшибки Тогда
		
		ШаблонСообщения = НСтр("ru = 'Не удалось подключиться к ТС ПИоТу.
						   |Описание ошибки: %1.'");
						   
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Результат.ТекстОшибки);
		ПоказатьПредупреждение(, ТекстСообщения);
		
		Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаНеВыполнена;
		
	Иначе
		
		Если Результат.Свойство("Результат") И ТипЗнч(Результат.Результат) = Тип("Структура") Тогда
			
			Если ОбщегоНазначенияБПОКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат.Результат, "НастройкиЭкземпляраТСПИоТ")
				И Результат.Результат.НастройкиЭкземпляраТСПИоТ <> Неопределено Тогда
				
				НастройкиЭкземпляраТСПИоТ                = Результат.Результат.НастройкиЭкземпляраТСПИоТ;
				НомерФискальногоНакопителяПоДаннымТСПИоТ = НастройкиЭкземпляраТСПИоТ.НомерФискальногоНакопителя;
				ИННПоДаннымТСПИоТ                        = НастройкиЭкземпляраТСПИоТ.ИНН;
				
				ОтобразитьНаФормеОтличияНастроекТСПИоТ();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИнтерфейсныеПроцедуры

&НаКлиенте
Процедура ОбработатьНавигационнуюСсылку(Знач НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПроверитьПодключениеТСПИоТ" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ПроверитьКорректностьЗаполненияНастроек() Тогда
			ВыполнитьПроверкуПодключенияНачало();
		Иначе
			ПоказатьПредупреждение(, НСтр("ru = 'Укажите настройки подключения и попробуйте снова.'"));
		КонецЕсли;
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "СкопироватьНомерФискальногоНакопителя" Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоместитьТекстВБуфераОбмена(НомерФискальногоНакопителяПоДаннымТСПИоТ);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "СкопироватьИННОрганизации" Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоместитьТекстВБуфераОбмена(ИННПоДаннымТСПИоТ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСБуферомОбмена

&НаКлиенте
Асинх Процедура ПоместитьТекстВБуфераОбмена(ТекстДляКопирования)
	
	Если СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
		
		ФорматДанных = СтандартныйФорматДанныхБуфераОбмена.Текст;
		
		Если Ждать СредстваБуфераОбмена.ПоддерживаетсяФорматДанных(ФорматДанных) Тогда
			
			ПомещаемыеДанные = Новый ЭлементБуфераОбмена(ФорматДанных, ТекстДляКопирования);
			ЗавершеноКопирование = Ждать СредстваБуфераОбмена.ПоместитьДанныеАсинх(ПомещаемыеДанные);
			
			Если ЗавершеноКопирование Тогда
				ПоказатьОповещениеПользователя(НСтр("ru = 'Текст скопирован в буфер обмена'"));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеСлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПутиПоУмолчаниюСервер()   
	
    Пути = МенеджерОборудованияТСПИоТ.СформироватьПутиВнутреннегоПИоТ(Объект.ИдентификаторЭкземпляра, РабочийКаталог);
    Объект.ПутьКДрайверу = Пути.ПутьКДрайверу; 
    Объект.ПутьДанныхЭкземпляра = Пути.ПутьДанныхЭкземпляра;
	
КонецПроцедуры    

&НаСервере
Процедура УстановитьПутьДрайверуПоУмолчаниюСервер()
	
    Пути = МенеджерОборудованияТСПИоТ.СформироватьПутиВнутреннегоПИоТ(Объект.ИдентификаторЭкземпляра, РабочийКаталог);
    Объект.ПутьКДрайверу = Пути.ПутьКДрайверу;
	
КонецПроцедуры      

&НаСервере
Процедура УстановитьПутьЭкземпляраПоУмолчаниюСервер()
	
    Пути = МенеджерОборудованияТСПИоТ.СформироватьПутиВнутреннегоПИоТ(Объект.ИдентификаторЭкземпляра, РабочийКаталог);
    Объект.ПутьДанныхЭкземпляра = Пути.ПутьДанныхЭкземпляра;
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступностьЭлементовВЗависимостиОтВидаПИоТ(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЭтоВнутреннийПИоТ = (Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыТСПИоТ.Внутренний1С"));
	ЭтоВнешнийПИоТ    = (Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыТСПИоТ.Внешний"));
	
	Элементы.ВнутреннийТСПИоТ.Видимость          = ЭтоВнутреннийПИоТ;
	Элементы.ВнешнийТСПИоТ.Видимость             = ЭтоВнешнийПИоТ;
	Элементы.ФискальноеУстройство.ТолькоПросмотр = (ЭтоВнешнийПИоТ Или ЭтоВнутреннийПИоТ) И Не Форма.СозданиеНовогоЭлемента;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПриУстановкеККТ()
	
	Если Не ЗначениеЗаполнено(Объект.ФискальноеУстройство) Тогда
		
		Организация  = Неопределено;
		РабочееМесто = Неопределено;
		Возврат;
		
	КонецЕсли;
	
	СтруктураРеквизитовПодключаемогоОборудования = ОбщегоНазначенияБПО.ЗначенияРеквизитовОбъекта(Объект.ФискальноеУстройство, "Организация, РабочееМесто");
	
	Организация  = СтруктураРеквизитовПодключаемогоОборудования.Организация;
	РабочееМесто = СтруктураРеквизитовПодключаемогоОборудования.РабочееМесто;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьНаФормеОтличияНастроекТСПИоТ()
	
	Если Не ЕстьПодсистемаГОСиС Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыТСПИоТ.Внешний") Тогда
		Возврат;
	КонецЕсли;
	
	ОтличияНастроек = ПроверитьОтличияНастроекТСПИоТ();
	
	Если Не ЗначениеЗаполнено(ИННПоДаннымТСПИоТ) И Не ЗначениеЗаполнено(НомерФискальногоНакопителяПоДаннымТСПИоТ) Тогда
		
		Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаНеВыполнялась;
		
	ИначеЕсли ОтличияНастроек.ЕстьОтличияНомераФН Тогда
		
		Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаВыполнена;
		Элементы.СтраницыРезультатНастройки.ТекущаяСтраница  = Элементы.СтраницаНомерФННеСовпадаетСНастройками;
		
		СформироватьНадписьОтличияФНОтНастроекТСПИоТ();
		
	ИначеЕсли ОтличияНастроек.ЕстьОтличияИНН Тогда
		
		Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаВыполнена;
		Элементы.СтраницыРезультатНастройки.ТекущаяСтраница  = Элементы.СтраницаИНННеСовпадаетСНастройками;
		
		СформироватьНадписьОтличияИННОтНастроекТСПИоТ();
		
	Иначе
		
		Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаВыполнена;
		Элементы.СтраницыРезультатНастройки.ТекущаяСтраница  = Элементы.СтраницаНастройкаЗавершенаКорректно;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьОтличияНастроекТСПИоТ()
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("ЕстьОтличияНомераФН", НомерФискальногоНакопителяПоДаннымТСПИоТ <> НомерФискальногоНакопителя);
	СтруктураВозврата.Вставить("ЕстьОтличияИНН",      ИННПоДаннымТСПИоТ <> ИННОрганизации И ЗначениеЗаполнено(ИННОрганизации));
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура СформироватьНадписьОтличияФНОтНастроекТСПИоТ()
	
	МассивСтрок = Новый Массив;
	
	СтрокаВажныйТекст = Новый ФорматированнаяСтрока(НСтр("ru = 'Номер фискального накопителя, указанного при настройке ТС ПИоТ, не совпадает с указанным'"),, ЦветВажногоТекста);
	СтрокаНомерФН     = Новый ФорматированнаяСтрока(Формат(НомерФискальногоНакопителяПоДаннымТСПИоТ, "ЧРГ=; ЧГ=;"),,,, "СкопироватьНомерФискальногоНакопителя");
	
	МассивСтрок.Добавить(СтрокаВажныйТекст);
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить(НСтр("ru = 'Номер ФН по данным ТС ПИоТ -'"));
	МассивСтрок.Добавить(" ");
	МассивСтрок.Добавить(СтрокаНомерФН);
	
	Элементы.НадписьПроверкаФННеВыполнена.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНадписьОтличияИННОтНастроекТСПИоТ()
	
	МассивСтрок = Новый Массив;
	
	СтрокаВажныйТекст = Новый ФорматированнаяСтрока(НСтр("ru = 'ИНН владельца ККТ не совпадает с указанным в настройках ТС ПИоТ.'"),, ЦветВажногоТекста);
	СтрокаИНН         = Новый ФорматированнаяСтрока(Формат(ИННПоДаннымТСПИоТ, "ЧРГ=; ЧГ=;"),,,, "СкопироватьИННОрганизации");
	
	МассивСтрок.Добавить(СтрокаВажныйТекст);
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить(НСтр("ru = 'ИНН по данным ТС ПИоТ -'"));
	МассивСтрок.Добавить(" ");
	МассивСтрок.Добавить(СтрокаИНН);
	
	Элементы.НадписьПроверкаИНННеВыполнена.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииФискальногоУстройстваНаСервере()
	
	Если ОбщегоНазначенияБПО.ИспользуетсяЧекопечатающиеУстройства() Тогда
		МодульОборудованиеЧекопечатающиеУстройства = ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройства");
		ПараметрыРегистрации = МодульОборудованиеЧекопечатающиеУстройства.ПараметрыРегистрацииУстройства(Объект.ФискальноеУстройство);
		Если ПараметрыРегистрации.Свойство("ЗаводскойНомерФН") И ЗначениеЗаполнено(ПараметрыРегистрации.ЗаводскойНомерФН) Тогда
			НомерФискальногоНакопителя = ПараметрыРегистрации.ЗаводскойНомерФН;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьДанныеПриУстановкеККТ();
	УстановитьОтображениеДанныхЛокальногоМодуляЧЗ();
	
	Если Не ЕстьПодсистемаГОСиС Тогда
		Возврат;
	КонецЕсли;
	
	МодульРаботаСКонтрагентамиИСВызовСервера = ОбщегоНазначенияБПО.ОбщийМодуль("РаботаСКонтрагентамиИСВызовСервера");
	ИННОрганизации                           = МодульРаботаСКонтрагентамиИСВызовСервера.ИННКПППоОрганизацииКонтрагенту(Организация).ИНН;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаименованиеЭкземпляраТСПИоТ()
	
	Если Не ЗначениеЗаполнено(Объект.Тип)
		Или Не ЗначениеЗаполнено(Объект.ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоВнутреннийПИоТ = (Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыТСПИоТ.Внутренний1С"));
	
	Объект.Наименование = ?(ЭтоВнутреннийПИоТ,
		СтрШаблон(НСтр("ru = '1С: ТС ПИоТ для %1'"), Строка(Объект.ФискальноеУстройство)),
		СтрШаблон(НСтр("ru = 'Внешний ПИоТ для %1'"), Строка(Объект.ФискальноеУстройство)));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьИОбновитьСписокТиповПИоТ(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.Тип.Доступность = ЗначениеЗаполнено(Объект.ФискальноеУстройство) И Форма.ДоступностьИспользованияВнутреннегоТСПИоТ;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеДанныхПрокси()
	
	ОтображатьДанныеПрокси = Не ЕстьПодсистемаБСП;
	
	Элементы.Прокси.Видимость                     = ОтображатьДанныеПрокси;
	Элементы.ПредставлениеПроксиСервера.Видимость = Не ОтображатьДанныеПрокси;
	
	Если Не ЕстьПодсистемаБСП Тогда
		Возврат;
	КонецЕсли;
	
	МодульПолучениеФайловИзИнтернета = ОбщегоНазначенияБПО.ОбщийМодуль("ПолучениеФайловИзИнтернета");
	НастройкаПроксиНаКлиенте         = МодульПолучениеФайловИзИнтернета.НастройкиПроксиНаКлиенте();
	
	ИспользоватьПрокси             = Истина;
	ИспользоватьСистемныеНастройки = Истина;
	
	Если ТипЗнч(НастройкаПроксиНаКлиенте) = Тип("Соответствие") Тогда
		
		ИспользоватьПрокси             = НастройкаПроксиНаКлиенте.Получить("ИспользоватьПрокси");
		ИспользоватьСистемныеНастройки = НастройкаПроксиНаКлиенте.Получить("ИспользоватьСистемныеНастройки");
		
		Если ИспользоватьПрокси И НЕ ИспользоватьСистемныеНастройки Тогда
			
			Сервер       = НастройкаПроксиНаКлиенте.Получить("Сервер");
			Порт         = НастройкаПроксиНаКлиенте.Получить("Порт");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ИспользоватьПрокси Тогда
		ПредставлениеПроксиСервера = НСтр("ru = 'не используется'");
	ИначеЕсли ИспользоватьСистемныеНастройки Тогда
		ПредставлениеПроксиСервера = НСтр("ru = 'используются системные настройки'");
	Иначе
		ПредставлениеПроксиСервера = СтрШаблон(НСтр("ru = '%1:%2'"), Сервер, Формат(Порт, "ЧГ=0"));                                     
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеДанныхЛокальногоМодуляЧЗ()
	
	ОтображатьДанныеЛокальногоМодуля                      = Не ЕстьПодсистемаГОСиС;
	Элементы.ЧестныйЗнак.Видимость                        = ОтображатьДанныеЛокальногоМодуля;
	Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ.Видимость = Не ОтображатьДанныеЛокальногоМодуля;
	Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ.Видимость    = Не ОтображатьДанныеЛокальногоМодуля;
	
	Если Не ЕстьПодсистемаГОСиС Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ.Гиперссылка    = Ложь;
		Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ.Гиперссылка = Ложь;
		
		АдресПодключенияЛМЧЗ = НСтр("ru = 'запишите настройку подключения ТС ПИоТ'");
		
		Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ.ЦветТекста    = ЦветНеактивнойГиперссылки;
		Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ.ЦветТекста = ЦветНеактивнойГиперссылки;
		
	Иначе  
		
		Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ.Гиперссылка    = Истина;
		Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ.Гиперссылка = Истина;
		
		МодульОбщегоНазначенияИСМП = ОбщегоНазначенияБПО.ОбщийМодуль("ОбщегоНазначенияИСМП");
		НастройкиЛокальногоМодуля = МодульОбщегоНазначенияИСМП.НастройкиОсновногоПодключенияЛокальномуМодулюЧестныйЗнакПоОрганизацииРабочемуМесту(Организация, РабочееМесто);
		
		НастроеноПодключениеЛМЧЗ = НастройкиЛокальногоМодуля.НастроеноПодключение;
		
		Если НастройкиЛокальногоМодуля.НастроеноПодключение Тогда
			АдресПодключенияЛМЧЗ     = НастройкиЛокальногоМодуля.Настройки.АдресПодключения;
		Иначе
			АдресПодключенияЛМЧЗ     = НСтр("ru = 'подключить'");
		КонецЕсли;
		
		Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ.ЦветТекста    = Новый Цвет();
		Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ.ЦветТекста = Новый Цвет();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыНастройкиПодключенияЛокальногоМодуля(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЕстьПодсистемаГОСиС Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтображениеДанныхЛокальногоМодуляЧЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияОкнаНастройкаПроксиСервера(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЕстьПодсистемаБСП Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтображениеДанныхПрокси();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
